Repository: 84000/data-translation-memory
Catalog: toh93-v4.tmx
Source language: bo
Languages: en

source: བདག་ད་བཅོམ་ལྡན་འདས་དང་། ཆོས་དང་། ཐ་བ་ཐམས་ཅད་སྤངས་པའི་འཕགས་པའི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ། །
en: Now and henceforth, I, together with my disciples and servants, take refuge in those three.

source: བདག་དེང་སླན་ཆད་སློབ་མ་དང་བཅས། གཡོག་དང་བཅས་ཏེ་གསུམ་ལ་སྐྱབས་སུ་མཆིའོ།
en: Blessed One, please explain which kind of living being one becomes after dying and leaving the god realms.”

source: །བཅོམ་ལྡན་འདས་ལྷའི་འཇིག་རྟེན་ནས་ཤི་འཕོས་ནས་འགྲོ་བ་གང་དུ་འགྱུར་བ་དེ་བཤད་དུ་གསོལ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དྲང་སྲོང་ཆེན་པོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ལྷའི་འཇིག་རྟེན་དུ་སྐྱེ་བའི་རང་བཞིན་གང་ཡིན་པ་དང་། ལྟས་གང་ཡིན་པ་ངས་བཤད་དོ། །
en: The Blessed One said, “Great Seer, that is why you should listen well and pay attention as I explain the natures and signs related to being reborn in the god realms. “

source: དྲང་སྲོང་ཆེན་པོ་འདི་ལ་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་སྦྱིན་པ་དང་། བསྟེན་པ་དང་། བསྒོམས་པ་དང་། མང་དུ་བྱས་པ་དང་། དད་པ་དང་ལྡན་པའི་སྐྱེས་བུ་ནི་འཆི་བའི་དུས་བྱས་ན་ཕྲེང་ཐོགས་ཀྱི་ལྷའི་ནང་དུ་སྐྱེའོ།
en: Great Seer, when a person who has given gifts of flowers, perfume, and garlands, offered their service, meditated, thoroughly studied, and had faith passes away, they will be born among the garland-bearing gods.

source: །དྲང་སྲོང་ཆེན་པོ་དེ་འཆི་བའི་དུས་ཀྱི་ཚེ་དེའི་ལུས་དྲི་རབ་ཏུ་ཞིམ་པའི་སྤོས་ཀྱིས་བསྒོས་པའི་མེ་ཏོག་བཞིན་དུ་སྣང་ངོ་།
en: Great Seer, at the time of death, their body will appear like a flower filled with the scent of an extremely fragrant perfume.

source: །དྲང་སྲོང་ཆེན་པོ་དེ་ལ་མེ་ཏོག་གི་ཆར་མང་པོ་རབ་ཏུ་བབ་ནས་འཆི་བའི་དུས་བྱེད་པར་འགྱུར།
en: Then, Great Seer, many showers of flowers will fall, and that person will pass away.

source: དེའི་ལུས་ལ་མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་རབ་ཏུ་འཐོར་བར་འགྱུར།
en: Flowers of various colors will be scattered all over their body.

source: དེའི་རྩ་ལག་སྙིང་དུ་སྡུག་པ་གང་ཡིན་པ་དེ་དག་ཀྱང་མེ་ཏོག་ཐོགས་ཤིང་མྱ་ངན་བྱེད་པར་འགྱུར།
en: Their relatives and loved ones will hold flowers as they mourn.

source: དེའི་བཞིན་གྱི་མདོག་སྣུམ་པར་འགྱུར། དེའི་མིག་ཧ་ཅང་བཙུམས་པ་ཡང་མ་ཡིན། ཧ་ཅང་ཕྱེ་བ་ཡང་མ་ཡིན་པར་འགྱུར། རྐང་ལག་ལེགས་པར་སྨྱང་ནས་འཆི་བའི་དུས་བྱེད་པར་འགྱུར་ཏེ།
en: Their complexion will soften, their eyes will be neither tightly closed nor wide open, and they will die with their feet and hands stretched out.

source: དེ་འཆི་བའི་དུས་ཀྱི་ཚེ་འདི་ལྟ་བུའི་རྟགས་འདི་དག་འབྱུང་། འདི་ལྟ་བུའི་ལྟས་ཀྱང་མཐོང་བར་འགྱུར་ཏེ།
en: Such signs will appear when they are dying. “They will see the following signs as well.

source: ཁང་པ་བརྩེགས་པ་མེ་ཏོག་སྣ་ཚོགས་རབ་ཏུ་སྦྱངས་པ། མེ་ཏོག་ཐ་དད་པས་མཛེས་པར་བྱས་པ། བུད་མེད་བརྒྱ་སྟོང་གིས་བསྐོར་བ་མཐོང་ནས་རྩ་ལག་རྣམས་ལ་འདི་སྐད་སྨྲ་སྟེ། བདག་གིས་རྨི་ལམ་ན་ཁང་པ་བརྩེགས་པ་ལྷའི་མེ་ཏོག་རྣམ་པ་སྣ་ཚོགས་དང་། མེ་ཏོག་གི་ལྡ་ལྡི་སྦྱངས་པ། ལྷའི་མེ་ཏོག་བཀྲམ་པ། བུད་མེད་བརྒྱ་སྟོང་གིས་བསྐོར་བ་དེ་ལྟ་བུ་མཐོང་ངོ་ཞེས་བདག་གི་རྩ་ལག་དེ་དག་ལ་སྨྲས་ནས། དེ་དག་གིས་ཀྱང་ཕྲེང་ཐོགས་ཀྱི་ལྷའི་ནང་དུ་སྐྱེ་བར་རིག་གོ །
en: They will see a multistoried mansion decorated with various flowers, beautified with different kinds of flowers, and surrounded by hundreds of thousands of women, and they will tell their relatives, ‘In my dream I saw a mansion decorated with various kinds of divine flowers and strings of flowers, strewn with divine flowers, and surrounded by hundreds of thousands of women.’ After they report this to their relatives, their relatives will know that the person is going to take birth among the garland-bearing gods. “

source: དེ་འཆི་བའི་དུས་བྱས་ནས་ཕྲེང་ཐོགས་ཀྱི་ལྷའི་ནང་དུ་སྐྱེ་བ་ན་ཕ་དང་མ་འདུས་པ་མཐོང་ནས་སྐྱེ་བ་ཡོངས་སུ་འཛིན་ཏོ།
en: When they have died and are reborn among the garland-bearing gods, they see their parents together and take new life.

source: །ཕྲེང་བ་ཐོགས་པ་དེ་དག་ཀྱང་གཉིས་ཀྱི་དབང་པོ་གཉིས་སྤྲོད་པར་འགྱུར་ཏེ། འདི་ལྟ་སྟེ་དཔེར་ན་འཛམ་བུའི་གླིང་པའི་མི་བཞིན་ནོ།
en: The garland-bearing gods have sex using the couple’s two sexual organs, just as the humans of Jambudvīpa do.

source: །དེ་ལ་དེ་དག་གི་རྣམ་པར་ཤེས་པ་ཕན་ཚུན་འདྲེས་ཤིང་དགའ་བ་ཙམ་གྱིས་ནོན་པས་འཇུག་པར་འགྱུར་གྱི་དེ་དག་ཁུ་བ་འབྱུང་བ་ནི་མ་ཡིན་ནོ།
en: When they do this, their consciousnesses blend together, and they are overwhelmed by even the slightest feeling of joy, yet neither of the two engaged in that action ejaculates. “

source: །དྲང་སྲོང་ཆེན་པོ་ལྷ་དེ་དག་ནི་ལྷ་མོས་མངལ་ན་ཞག་བདུན་དུ་འཛིན་ཏོ། །ཞག་བདུན་འདས་ནས་དཀུ་གཡས་པ་ནས་འབྱུང་ངོ་།
en: Those gods remain in a goddess’s womb for seven days, and after seven days have passed the child is born from the left side.

source: །དྲང་སྲོང་ཆེན་པོ་དེ་དེའི་མངལ་ནས་བྱུང་ནས་ལྷའི་མེ་ཏོག་དྲི་རབ་ཏུ་ཞིམ་པ་མཆོག་ཏུ་ཡིད་དུ་འོང་བ་སྣ་ཚོགས་པ་བརྒྱུས་པའི་ཕྲེང་བ་བྲང་ལས་འབྱུང་བར་འགྱུར་རོ།
en: Great Seer, after the child emerges from the womb, a garland stringing together various supremely appealing and fragrant divine flowers emerges from their chest.

source: །དྲང་སྲོང་ཆེན་པོ་དེའི་ཕྲེང་བ་དྲི་རབ་ཏུ་ཞིམ་པའི་ངད་རླུང་གིས་བདས་ནས་ཕྱོགས་ཀུན་དུ་དཔག་ཚད་ཙམ་དུ་འགྲོའོ། །ཕྲེང་བ་དེ་ལ་ཁ་དོག་བདུན་ཡོད་པ་འདི་ལྟ་སྟེ། དཀར་པོ་དང་། དམར་པོ་དང་། སེར་པོ་དང་། སྔོན་པོ་དང་། བཻ་དཱུརྱ་དང་། རྨ་དང་། པད་མ་རཱ་ག་ལས་ལྷག་པ་སྟེ། བལྟ་ན་སྡུག་པ་སྣ་ཚོགས་ཀྱི་ཕྲེང་བ་དེ་དག་དེ་མ་ཤི་བར་དུ་མ་རྙིས་པར་ཐོགས་པར་འགྱུར་ཏེ། དེའི་ཕྱིར་དེ་ཕྲེང་ཐོགས་ཞེས་བྱའོ།
en: Great Seer, the fragrant scent of that garland is carried by the wind and permeates all directions for the distance of about one yojana. In addition to their garlands having seven different colors of flowers—white, red, yellow, blue, beryl, lotus, and red lotus—the beautiful, variegated garlands they bear do not wilt for as long as they are alive. That is why they are called the garland-bearing gods. “

source: །དྲང་སྲོང་ཆེན་པོ་ཕྲེང་ཐོགས་ཀྱི་ལྷ་དེ་དག་གི་གནས་དེ་ན་ཤིང་ལྗོན་པ་ཧ་ཅང་ཡང་མི་རིང་། ཧ་ཅང་ཡང་མི་ཐུང་བ་འབྲས་བུ་སྣ་ཚོགས་ཧ་ཅང་ཡང་མི་སྐྱུར།
en: Great Seer, the trees that grow in the realm of the garland-bearing gods are neither too tall nor too short, and their various fruits are neither too sour nor too sweet.

source: ཧ་ཅང་ཡང་མི་མངར་ལ་བདུད་རྩི་དང་འདྲ་བའི་རོ་བྲོ་བ་མང་པོ་བཟང་པོ་ལྷའི་རོ་བྲོ་བ་ཡན་ལག་བརྒྱད་དང་ལྡན་པ་དག་ཡོད་དོ།
en: Their many excellent flavors are like ambrosia, and they have eight divine flavors.

source: །དྲང་སྲོང་ཆེན་པོ་ཤིང་དེ་དག་གི་འབྲས་བུ་དེ་དག་གི་ཚད་ནི་ཤིང་ཏོག་བིལ་བ་ཙམ་མོ།
en: Great Seer, the fruits of those trees are the size of a bilva fruit.

source: །དེ་དག་གི་ནང་ནས་ལྷ་རྣམས་གང་དང་གང་ཟ་བར་འདོད་པའི་ཟས་དེ་དང་དེ་དེ་དག་ལ་ཉེ་བར་གནས་ཏེ།
en: Whatever food the gods wish to eat from those trees is always within their reach.

source: ལྷ་དེ་དག་ནི་འབྲས་བུ་ཟ་བར་ལྟའི། ཁམ་གྱིས་ཟ་བའི་ཟས་ཅན་ནི་མ་ཡིན་ནོ།
en: The gods appear to consume the fruit, but they are not beings that consume food by the mouthful.

source: །དྲང་སྲོང་ཆེན་པོ་ལྷ་དེ་དག་གིས་ཕྱོགས་ནི་རབ་ཏུ་རྣོ་བའི་ཚེར་མའི་བག་མེད་པ། མེ་ཏོག་གིས་མཛེས་པར་བྱས་པ་ནེའུ་གསིང་གིས་ཁེབས་པ།
en: Great Seer, in the realm of those gods one need not be careful of sharp thorns, and the land is covered with grassy meadows beautified with flowers.

source: གསེར་དང་དངུལ་གྱི་ཕྲེང་བ་སྣ་ཚོགས་ཀྱིས་མཛེས་པར་བྱས་པ། ཡིད་ཙམ་སེར་བ་ལྟ་བུར་སྣང་བའོ།
en: It is decorated with various strings of gold and silver, which appear like hail as soon as one thinks of them. “

source: །དྲང་སྲོང་ཆེན་པོ་གནས་དེ་ན་ཕྲེང་བ་ཐོགས་པའི་ལྷ་དེ་དག་ལྷའི་བུ་མོ་མཆོག་ཏུ་འབར་བའི་གོས་དང་རྒྱན་ཅན། སྐར་ཁུང་དང་། ཁ་ཁྱེར་དང་། པུ་ཤུའི་ངོས་ལ་རྒྱུ་བ། བདེ་བ་དང་ཡིད་བདེ་བ་མཆོག་དང་ལྡན་པ་དག་དང་གནས་སོ།
en: Great Seer, the garland-bearing gods live in that realm with divine maidens who are clothed in brilliantly glowing robes and ornaments, who wander past the windows, on the balconies, and along the parapets, and who are supremely happy and content.

source: །དེ་ན་དེ་དག་གི་ཚེའི་ཚད་ནི་ལོ་ཉིས་སྟོང་ཐུབ་བོ།
en: They have a lifespan of two thousand years. “

source: །དེ་ན་ཚེ་ཟད་པའི་ལྟས་འབྱུང་བ་ནི་ཤིང་གང་གི་དྲུང་ན་འདུག་འདུག་པའི་ཤིང་དེ། ལོ་མ་རྙིས། ཡལ་ག་འཕྱང་། མེ་ཏོག་དང་དྲི་ཡང་མེད་པར་འགྱུར་ཏེ།
en: The signs that their life is coming to an end are that the leaves on the tree in front of which they are seated will wilt; its branches will droop, and it will lose its flowers and scent.

source: སེམས་ཅན་དེ་ཡང་ཤིང་དྲུང་དེ་ན་མི་དགའ་བ་རྙེད་པར་འགྱུར། དེའི་ཕྲེང་བ་སྔོན་མ་རྙིས་པ་དེ་ཡང་རྙེས་པར་འགྱུར།
en: The being seated in front of that tree will become unhappy, and his garland, which until then had never wilted, will wilt.

source: ལྷའི་འཇིག་རྟེན་གྱི་རླུང་བསིལ་ཞིང་བདེ་བར་ལྡང་བ་དེ་ཡང་དྲོ་བར་ལྡང་བར་འགྱུར་བ་སྟེ། དེའི་གནས་དེ་དག་མཐོང་ནས་ལྷའི་བུ་མོ་དེ་དག་ང་རོ་གཅིག་ཏུ་སྙིང་རྗེ་རྗེ་སྐད་སྨྲེ་སྔགས་འདོན་ཏེ།
en: The cool and pleasant breeze that previously blew in that divine realm will become hot, and the divine maidens, when they see that happening, will lament and weep.

source: སེམས་ཅན་དེ་ཡང་མཐོ་རིས་ཀྱི་གྲོང་ཁྱེར་ལྷའི་ཤིང་དང་། མེ་ཏོག་དང་། འབྲས་བུས་མཛེས་པར་བྱས་པ་དང་། ལྷའི་བུ་མོའི་ཚོགས་དང་འདྲེ་བ་ཡོངས་སུ་བཏང་ནས་བསོད་ནམས་ཟད་པར་འགྱུར་བ་འདི་ནི་མཐོ་རིས་ཀྱི་ཉེས་པའོ།
en: That being will leave behind that citadel of the higher realms beautified with divine trees, flowers, and fruits as well as the group of divine maidens that accompanied him, and his merit will be exhausted.

source: །དྲང་སྲོང་ཆེན་པོ་དེ་ནས་ལྷའི་བུ་མོ་དེ་དག་གིས་དེའི་མཐའ་སྐོར་ནས་ཉམ་ཐག་པ་ཆེན་པོའི་སྒྲར་ངུ་སྟེ།
en: This is the problem with the higher realms. “Great Seer, the divine maidens around him will begin to cry and wail with great sadness, saying, ‘Alas!

source: ཀྱི་ཧུད་མི་རྟག་པ་འདི་ནི་སྙིང་རྗེ་མེད་པའོ།
en: This impermanence is pitiless.

source: །འདི་ལྟར་སྙིང་ལ་དགའ་བ་སྐྱེས་ཤིང་འཁོད་འཁོད་པ་ལས་མི་འདོད་བཞིན་དུ་དབང་མེད་པར་མཐོ་རིས་ནས་ལྟུང་ངམ།
en: Is he going to fall from the higher realms, powerless and against his will, after he has lived among us and brought us such joy?

source: ཨེ་མའོ་ལྷ་གཞོན་ནུ་ད་མྱུར་དུ་མིའི་འཇིག་རྟེན་དུ་མིར་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་མྱ་ངན་བྱེད་པ་ན་རིམས་དྲག་པོས་བཏབ་ནས་དེ་རིམས་དྲག་པོས་ནོན་ཏེ།
en: Alas, young god, may you quickly take rebirth in the human realm!’ “As they express their sorrow, he will be struck by an acute illness.

source: དེའི་ལུས་གཅིག་ཏུ་འབར་བར་འགྱུར་རོ།
en: It will overwhelm him, and his body will at once burst into flame.

source: །ལུས་འབར་བས་གནས་དེ་ནས་འཆི་འཕོ་བར་འགྱུར་ཏེ། དེའི་འབར་བ་དེ་ཁར་ཞི་བར་འགྱུར་རོ།
en: As his body is burning, he will pass away and leave that realm, and the fire will go out.

source: །དེ་ནས་ཤི་འཕོས་ནས་ཕ་དང་མ་འདུས་པ་མཐོང་བས་སྐྱེ་བ་ཡོངས་སུ་འཛིན་ཏོ། །
en: After he has died and passed on, he will see his new parents together and assume a new rebirth. “

source: དྲང་སྲོང་ཆེན་པོ་ཕྲེང་ཐོགས་སུ་ཉེ་བར་འགྲོ་བའི་ལྷའི་བུ་དེ་འདི་ལྟར་སྐྱེ་བར་བལྟ་སྟེ། མའི་མངལ་ན་གནས་པའི་ཚེ་ལྟས་འབྱུང་བ་ནི་མངལ་ན་གནས་པ་ན་མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་འདོད་པ་དང་། འབྲས་བུ་སྣ་ཚོགས་འདོད་པ་དང་། ནགས་ཚལ་སྣ་ཚོགས་སྟུག་པོ་ཉམས་དགའ་བ་འདོད་པར་འགྱུར།
en: Great Seer, the signs that the child taking that birth was a god in the realm of the garland-bearing gods are as follows: while he resides in his mother’s womb, she will desire flowers, perfumes, and garlands; she will crave various kinds of fruit; she will long for pleasant thickets and various types of forest groves; and she will have a constant feeling of contentment.

source: བདེ་བ་ཐམས་ཅད་དང་ལྡན་པར་འགྱུར། ལུས་ལ་ན་བ་མེད་པར་མངལ་ན་འཛིན་པར་འགྱུར།
en: She will not experience any discomfort while the child is in her womb.

source: རྨི་ལམ་ན་བསོད་ནམས་སྣ་ཚོགས་ཀྱི་ཚོང་འདུས་མེ་ཏོག་གི་ཕྲེང་བ་སྤྱངས་པའི་གྲོང་ཁྱེར་མཐོང་སྟེ།
en: In her dreams, she will see an auspicious marketplace and a citadel decorated with flower garlands.

source: འདི་དག་ནི་དེའི་མས་ལྟས་མཐོང་བའོ།
en: Those are the signs that will be seen by his mother. “

source: །དྲང་སྲོང་ཆེན་པོ་གཞན་ཡང་ལྷ་གཞོན་ནུ་དེ་བཙས་ནས་ཕྲེང་བ་ཐོགས་པའི་ལྷ་ལས་ཤི་འཕོས་པས་ཤིན་ཏུ་དགའ་བ་ཆེན་པོ་སྐྱེའོ།
en: Moreover, Great Seer, after that god is reborn, he will be overjoyed to have taken birth as a human after leaving his life as a garland-bearing god.

source: །གོས་དཀར་པོ་ལ་དགའ་བར་འགྱུར། མཛེས་པ་དང་ལྡན་པར་འགྱུར། ཤེས་པ་དང་ལྡན་པར་འགྱུར།
en: He will have an affinity for white clothing and be good looking and wise.

source: འདོད་པ་ལ་རབ་ཏུ་ཆགས་ཤིང་འགྲོ་བ་དང་། རྒྱུ་བ་འཕྱར་བག་ཅན་དང་།
en: He will delight in sensual desire, and his gait and stride will be gentle and reserved.

source: དུས་སྟོན་དང་། ལྟད་མོ་དང་། ཕྲ་བའི་གོས་ལ་མངོན་པར་དགའ་བར་འགྱུར། ཀུན་དགའི་ར་བ་ལ་དགའ་བ་དང་། ཕ་རོལ་འབྱོར་པ་མཐོང་ན་འདོད་པ་སྟེ།
en: He will like festivals, performances, and garments of fine cloth. He will be fond of gardens, and when he sees another person’s wealth, he will desire it.

source: དྲང་སྲོང་ཆེན་པོ་འདི་དག་ནི་ཕྲེང་ཐོགས་ཀྱི་ལྷ་ལས་མིར་སྐྱེ་བའི་ལྟས་སུ་བལྟ་བ་དག་གོ། །།
en: Great Seer, these should be viewed as signs that a garland-bearing god has been reborn as a human being.

source: དྲང་སྲོང་ཆེན་པོ་གཞན་ཡང་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷར་སྐྱེ་བའི་ལྟས་དང་། འཆི་འཕོའི་ལྟས་སུ་ལྟ་བ་ནི་དྲང་སྲོང་ཆེན་པོ་འདི་ལ་དམན་པའམ། མགོན་མེད་པ་ལ་ཟས་བཟང་པོ་དང་། ན་བའི་གསོས་སྨན་དང་། ཀུན་འཐུང་བའི་ཆུ་གྲང་མོ་དང་། ཆུ་མིག་དང་། མཚེའུ་དང་། ལྟེང་ཀ་དང་།
en: [B2] “Great Seer, the following should be seen as signs related to taking birth and passing away in the divine realm of the Four Great Kings.

source: ལུ་མ་དང་། རྫིང་བུ་དང་། ཁྲོན་ཆུ་བྱིན་ནས། དད་པ་དང་། ཡིད་རབ་ཏུ་དགའ་ཞིང་འཆི་བའི་དུས་ཀྱི་ཚེ་ཉོན་མོངས་པའི་འབར་བ་མེད་པའི་ལུས་སུ་འགྱུར།
en: When a faithful person who takes joy in giving excellent food to those who are lowly and vulnerable, giving medicine to the sick, and providing communal drinking sources with cool water, springs, lakes, pools, ponds, and water tanks is dying, their body will become free from the burning of the defilements.

source: དེའི་ལུས་རིད་པར་མི་འགྱུར། མདོག་ངན་པར་མི་འགྱུར་རྔུལ་དང་དྲི་མ་ཆགས་པར་མི་འགྱུར།
en: Their body will not become emaciated, it will not develop a poor complexion, and it will not sweat or have a foul odor.

source: དེའི་ལུས་ལ་ཉམ་ང་བའི་ཚོར་བ་མི་འབྱུང་།
en: They will not experience feelings of dread in their bodies.

source: སྐད་དམན་པ་དང་། རྩ་ལག་དང་བྲལ་ཞིང་གདུང་བ་དང་ལྡན་པར་མི་འགྱུར།
en: They will not utter vulgar language, and they will not be separated from their loved ones or experience discomfort.

source: དེ་བཀྲེས་པ་དང་། སྐོམ་པས་ཉན་པར་མི་འགྱུར། དེའི་ལུས་བསྐུམ་པ་དང་། སྨྱང་བ་ལ་སོགས་པས་སྡུག་བསྔལ་བར་མི་འགྱུར། བཤང་གཅི་འབྱུང་བར་མི་འགྱུར།
en: They will not suffer from hunger and thirst, their body will not suffer from such things as shrinking or swelling, and they will not defecate or urinate.

source: ཡུལ་ལས་ཡོངས་སུ་ཉམས་པས་སྒྱིད་ལུག་པར་མི་འགྱུར། དེའི་དབང་པོ་ཞུམ་པར་མི་འགྱུར་བ་སྟེ།
en: They will not be disheartened as the sense objects fade away, and their sense faculties will not deteriorate.

source: དེ་ལྟ་བུ་དེ་ནི་མཐོ་རིས་ཀྱི་བདེ་བ་དང་ལྡན་ཞིང་འཆི་བའི་དུས་བྱེད་པར་འགྱུར་རོ།
en: Such signs mean that they can take comfort in attaining a higher rebirth as the moment of death approaches. “

source: །དེའི་ལུས་ཡོངས་སུ་བཏང་ནས་རྣམ་པར་ཤེས་པ་དེ་རབ་ཏུ་དགའ་བར་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་ནང་དུ་སྐྱེད་མོས་ཚལ་དང་། ནགས་ཚལ་སྟུག་པོའི་ནང་དུ་གནས་པར་འགྱུར་རོ།
en: After it leaves the body, the consciousness will be joyful and come to dwell among the gardens and thick groves of the divine realm of the Four Great Kings.

source: །དེ་འཆི་ཁར་ལྷའི་རིས་དེ་མཐོང་ནས་བཞིན་མེ་ཏོག་པད་མ་ལྟ་བུར་འགྱུར།
en: At the time of death, they will see that divine realm, and their face will look like a lotus flower.

source: དེའི་ཁ་ནས་དྲི་ཞིམ་པོ་འབྱུང་བར་འགྱུར། དེ་ལ་མེ་ཏོག་སྣ་ཚོགས་དྲི་དང་ལྡན་པའི་རླུང་རྗེས་སུ་འཐུན་པ་ལྡང་བར་འགྱུར།
en: Their mouth will give off a pleasant odor, and there will be a pleasant breeze carrying the sweet fragrance of various flowers.

source: དེ་ཤི་ནས་ཀྱང་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་ནང་ན་ཕ་མ་འདུས་ནས་སྐྱེད་མོས་ཚལ་ན་རྩེ་ཞིང་འདོད་པ་མྱོང་བས་རྒྱགས་དྲེགས་ནས་ལག་པ་གཡས་པས་ལྷ་མོའི་ལྟེ་བ་ལ་རེག་པར་མཐོང་ནས།
en: After they are dead, they will see their future parents together in the divine realm of the Four Great Kings, making love in a garden and drunk with lust.

source: དེའི་རྐྱེན་གྱིས་རྣམ་པར་ཤེས་པ་ལྷ་མོ་དེའི་པང་པར་སྐྱེ་བ་ཡོངས་སུ་འཛིན་ཏོ།
en: They will see the father touch the goddess’s navel with his right hand, and those conditions will lead the consciousness to take rebirth in the lap of that goddess.

source: །དེ་ཞག་བདུན་འདས་ནས་དྲི་མ་མེད་པའི་རྣ་ཆ་འགུལ་བའི་མགོ་དང་ལྡན་པའི་གཞོན་ནུར་མངོན་པར་འགྲུབ་སྟེ། དགོད་པ་དང་། གར་བྱེད་པ་དང་། གླུ་ལེན་པ་དང་། འདོད་པའི་ལོངས་སྤྱོད་སྐྱེད་ནུས་སོ།
en: After seven days, they will transform into a young man whose head is ornamented by immaculate earrings, and he will be able to laugh, dance, sing, and indulge his sensual desires. “

source: །དྲང་སྲོང་ཆེན་པོ་དེ་ལ་རྒྱལ་ཆེན་བཞིའི་ལྷའི་རིས་ཀྱིས་ཕྱོགས་ནི་དངུལ་དང་ལྡོང་རོས་རྣམ་པར་བཀྲ་བ་སྣ་ཚོགས་ཀྱིས་སྤྲས་ཤིང་མཛེས་པར་བྱས་པ།
en: Great Seer, the land in the divine realm of the Four Great Kings is ornamented and beautified by various hues of silver and orange.

source: ལྷ་མོ་བརྒྱ་སྟོང་གིས་ལེགས་པར་བརྒྱན་པ། ལྷའི་གནས་མཐོ་བ། རང་བཞིན་གྱིས་མཛེས་པ། རེག་ན་བདེ་བའི་རླུང་ལྡང་བའོ།
en: It is ornamented with hundreds of thousands of goddesses and is a lofty divine realm of natural beauty where gentle breezes blow. “

source: །དྲང་སྲོང་ཆེན་པོ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དེ་དག་གི་སྐྱེད་མོས་ཚལ་ནི་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་གྲུ་བཞི་ལྷམ་པ། ནོར་བུའི་སྒྲོན་མས་སྣང་བར་བྱས་པ།
en: Great Seer, the garden in the divine realm of the Four Great Kings is a square measuring eighty-four thousand yojanas across that is illuminated by jewel lamps.

source: ཤིང་གི་ཡལ་ག་དང་རྩེ་མོ་ལ་དཔག་བསམ་གྱི་ཤིང་གི་རས་བཅོས་བུ་དང་། རྒྱ་དར་ལའི་ལྡ་ལྡི་སྤྱངས་པ།
en: On the branches and tops of the trees hang very fine quality cloths of cotton from the wish-granting tree and cords of fine Indian cloth.

source: ནགས་ཚལ་གྱི་བར་འཇམ་ཞིང་ཡིད་དུ་འོང་བ། ཁྱིམ་གྱི་བར་ན་རྟག་ཏུ་པི་བང་དང་། གླིང་བུ་དང་། རྫ་རྔ་དང་། ཁར་རྔའི་སྒྲ་འབྱུང་བའོ།
en: The forest clearings are soft and pleasant, and the inner chambers of the houses there continually ring with the sounds of lutes, flutes, clay drums, and kettledrums. “

source: །དྲང་སྲོང་ཆེན་པོ་ལྷའི་གནས་ན་གནས་པ་དེ་དག་ཟས་ཁམ་གྱི་ཟ་བ་ཅན་ཏེ། དྲི་རབ་ཏུ་ཞིམ་པའི་དྲི་དང་། ཁ་དོག་དང་། རོ་དང་། རེག་པ་དང་། ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པར་རིག་པར་བྱའོ། །དེ་དག་རེ་རེ་ལ་ཡང་གསེར་གཞོང་གཉིས་གཉིས་ཡོད་དེ་དེ་ན་གང་ཟས་གང་འདོད་པ་དེ་ནི་དེའི་ཕུན་སུམ་ཚོགས་པར་གཞོང་པ་དེ་ལས་འགྲུབ་པར་འགྱུར་རོ།
en: Great Seer, those who dwell in the divine realm of the Four Great Kings eat solid foods that are known to possess an extremely appetizing aroma and to have appealing colors, tastes, textures, and other excellent qualities.

source: །ལྷའི་མེ་ཏོག་གི་ཁུ་བ་རོ་དང་ལྡན་པ་མངོན་པར་འགྲུབ་སྟེ། དེ་ནི་མེ་ཏོག་གི་ཆང་ཞེས་བྱའོ།
en: Each of those gods has two golden basins, and whatever food they wish for is provided perfectly from those basins.

source: །དྲང་སྲོང་ཆེན་པོ་ཆང་དེ་ནི་དྲི་རབ་ཏུ་ཞིམ་པ། མཆོག་ཏུ་བདེ་བ་བསིལ་བ།
en: They are also provided with a delicious divine flower nectar called flower wine.

source: དྲིས་ཀྱང་ར་རོ་བ་མངོན་པར་འགྲུབ་ན་འཐུངས་པས་ལྟ་ཅི་སྨོས་ཏེ། དེ་ན་ལྷ་གཞོན་ནུ་ར་རོ་བར་འགྱུར་རོ།
en: That wine, Great Seer, has a delicious aroma that is supremely pleasing and refreshing. Even to smell it, let alone drink it, is intoxicating, and the young gods become intoxicated on that drink. “

source: །དྲང་སྲོང་ཆེན་པོ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དེ་དག་གི་གཞལ་མེད་ཁང་ནི་མཛེས་བྱེད་ཅེས་བྱ་སྟེ།
en: Great Seer, the palaces of the realm of the Four Great Kings are called Beautifying.

source: རྟག་ཏུ་མེ་ཏོག་རྒྱས་པ་འཁྲི་ཤིང་གིས་མཛེས་པར་བྱས་པ།
en: They are always beautified by vines with blooming flowers.

source: གསེར་དང་། དངུལ་དང་། རྡོ་རྗེ་འབར་བའི་ཀ་བ་བརྒྱ་སྟོང་གིས་ཕྱོགས་ཕྱོགས་ཤིན་ཏུ་བརྟན་པ།
en: They are firmly supported on all sides by hundreds of thousands of pillars that are gold, silver, and radiant diamond.

source: ལྷའི་མལ་ཆ་དང་། གདིང་བ་བཏིང་བས་ས་ཕྱོགས་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ།
en: The floorplans are symmetrical with divine beds and carpets.

source: ལྷ་མོ་བཟོར་བྱས་པ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པའི་ཁྱད་པར་དང་ལྡན་པ། སྟེག་ཅིང་འཇོ་བའི་རྗེས་སུ་ཆགས་པ། ལྷའི་གོས་འབར་ཞིང་རྣམ་པར་མཛེས་པས་སྤུད་སྤུད་པ།
en: They are filled and surrounded by mesmerizing goddesses with various types of ornaments who are graceful, charmingly affectionate, and richly adorned with divine robes that glow and enhance their beauty.

source: ཀ་ལ་པིང་ཀ་དང་། བུང་བའི་ཚོགས་ཀྱི་སྒྲ་ལྟ་བུ་དང་ལྡན་པ།
en: Their voices are as melodious as a kalaviṅka’s song or the humming of bees.

source: གཟུགས་རབ་ཏུ་ཆེ་ཞིང་ཤིན་ཏུ་གཞོན་ཤ་ཆགས་པ།
en: Their bodies are large and youthful.

source: གླུ་དང་། གར་དང་། སིལ་སྙན་དང་། འཛུམ་ཞིང་རྩེ་བས་རྒྱགས་པའི་ཤས་ཆེ་ལ་རབ་ཏུ་སྒེག་པ་ཤ་སྟག་གིས་བསྐོར་ཅིང་གང་བ་སྟེ།
en: They are intoxicated and aroused by singing, dancing, ringing their cymbals, smiling, and playing.

source: གནས་དེའི་ཀ་བ་ནི་གསེར་ཆུ་དང་། དངུལ་ཆུས་རྣམ་པར་བྲིས་པ།
en: The pillars are painted with liquid gold and silver.

source: དར་གྱི་རྒྱལ་མཚན་སྦྱངས་པ། རྒྱལ་མཚན་དང་བ་དན་བསྒྲེང་བའོ།
en: They are ornamented with silk banners, and the banners and flags are raised. “

source: །གཞལ་མེད་ཁང་དེ་དག་ན་འདི་ལྟ་སྟེ། ཡུལ་འཁོར་སྲུང་དང་། འཕགས་སྐྱེས་པོ་དང་། མིག་མི་བཟང་དང་། ལུས་ངན་པོ་དང་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་ལྷའི་འདོད་པ་དང་།
en: The Four Great Kings who reside in those palaces are Dhṛtarāṣṭra, Virūḍhaka, Virūpākṣa, and Kubera.

source: བདེ་བ་དང་། རྩེ་བ་མྱོང་ཞིང་རབ་ཏུ་དགའ་སྟེ། དགའ་བ་དང་བདེ་བ་དང་ལྡན་ལ།
en: They experience and enjoy divine sensual desire, happiness, and play, and they are happy and delighted.

source: གླུ་དང་། གར་དང་། སིལ་སྙན་དང་། ལྷའི་ཁ་ཟས་ཟ་བས་དབང་པོ་ཚིམ་ཞིང་བདེ་བ་ཐམས་ཅད་དང་ལྡན་པར་གནས་སོ།
en: Their sense faculties are pleased by singing, dancing, the ringing of cymbals, and eating divine food, and they live there happy in every way. “

source: །དྲང་སྲོང་ཆེན་པོ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་རིས་དེ་ན་ལྷ་གཞོན་ནུ་དེ་དག་ལག་པ་རིང་ཞིང་ཤ་རྒྱས་པ།
en: Great Seer, the young gods in the divine realm of the Four Great Kings all have long, muscular arms.

source: གླང་པོ་རྒྱགས་པའི་ཚུལ་དུ་འགྲོ་བ། སྐྱེས་བུ་སྟོང་གི་སྟོབས་དང་རྩལ་ཡོད་པ། ལྷའི་ལུས་ཤིན་ཏུ་འཇམ་པ་ཤ་སྟག་གོ །
en: They walk with the gait of an elephant in rut, they have the power and prowess of a thousand men, and their divine bodies have soft features.

source: དེ་དག་གི་དྲི་ཆང་གི་ཤས་ཆེ་བས་དཔག་ཚད་ཁོར་ཡུག་ཆང་དྲིར་ཕྱོགས་པར་བྱེད་དོ།
en: The smell of wine pervades all around them for the distance of one yojana because of the large quantities of fragrant wine they consume.

source: །ལྷ་དེ་དག་གི་ཚེའི་ཚད་ནི་ལོ་བཞི་སྟོང་ཐུབ་སྟེ། བར་མ་དོར་འཆི་བའི་དུས་མི་བྱེད་དེ། དེ་དག་ཐམས་ཅད་བདེ་བ་དང་། ཡིད་བདེ་བ་དང་། དགའ་བར་གནས་སོ།
en: The lifespan of those gods is four thousand years, they have no untimely death, and all of them live in joy, happiness, and contentment. “

source: །ལྷའི་རིས་དེ་ན་སྐལ་བ་བཟང་པོ་ཅན་གསེར་དྲི་མ་མེད་པའི་འོད་ཀྱིས་བརྒྱན་པ་དག་ནགས་ཀྱི་ཕྲེང་བས་མཛེས་པར་བརྒྱན་པ།
en: The fortunate ones in that divine realm have halos of immaculate golden light, and that realm is beautifully adorned with forest groves.

source: དགའ་བ་སྐྱེད་པ་ལ་སོགས་པའི་སྐྱེད་མོས་ཚལ་བཟང་པོ་དྲི་ང་བ་མེད་པ་རྣམས་ནི་སྙིང་དགའ་བ་དང་ལྡན་པར་གནས་སོ།
en: They live in excellent gardens, such as Joy Producing, that are pleasant and without foul odor.

source: །དེ་དག་དེ་ན་གནས་པ་ན་མེ་ཏོག་སིལ་མ་བཀྲམ་ཞིང་ནོར་བུ་དང་གསེར་གྱིས་མཛེས་པར་བྱས་པ། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ། གྲུ་བཞི་པ།
en: The places where they dwell are sprinkled with flower petals and beautified with gems and gold.

source: ནོར་བུའི་ཐེམ་སྐས་ཀྱིས་བརྒྱན་པ།
en: They are symmetrical, square, and ornamented with jeweled staircases.

source: ལྷའི་བུ་མོ་བརྒྱ་སྟོང་གླུ་སྙན་པ་ལེན་པ།
en: They resound with the sweet songs of hundreds of thousands of goddesses, and there are jewel caskets that grant any wish they might utter. “

source: ནོར་བུའི་སྣོད་རྣམས་བདག་ཉིད་སྒྲ་འབྱིན་པའི་རྗེས་སུ་ཆགས་པ་ན་དེ་དག་གནས་གནས་པ་ལས་དེ་དག་བསོད་ནམས་ཟད་པས་ཚེ་ཟད་པར་འགྱུར་བའི་ལྟས་གཉིས་འབྱུང་སྟེ།
en: As he lives in that realm his merit is exhausted, and the following two signs that his lifespan is exhausted appear.

source: དེ་ཐོག་མར་གྲིབ་མ་མི་སྣང་བར་འགྱུར་ཞིང་མེ་ཏོག་ལས་དྲི་མི་འབྱུང་བ་དང་། ལྷའི་བུ་མོ་དང་ཀུན་སྨྲ་བའི་སྒྲ་སྙན་པ་མི་ཐོས་པའོ།
en: First, he no longer casts a shadow, smells no longer arise from flowers, and he cannot hear the sweet words of the goddesses conversing with one another.

source: །ཡང་ལྷ་གཞོན་ནུ་དེ་ལྷ་ཡུལ་བའི་ལྷའི་གནས་རྣམས་སུ་འདུ་ཞིང་མི་འགྲོ་སྟེ།
en: The youthful god will also no longer travel to or assemble in the divine abodes of the heavenly realm.
